InformationRegisters/АР_НастройкаПечатнойФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_НастройкаПечатнойФормы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УполномоченноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлПечать</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлПодписьРуководителя</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>С_Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектыАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаКогоПодписывает</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>С_Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АР_НастройкаПечатнойФормы/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьКартинкуПечать(Команда)
	ЗагрузитьКартинку("Печать");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинку(ИмяЭлементаСКартинкой)
	
	//Если Объект.Ссылка.Пустая() Тогда
	//	Если НЕ Записать() Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	СтандартнаяОбработка=ложь;
	
	ВыбираемаяКартинка = ИмяЭлементаСКартинкой;
	
	Если ИмяЭлементаСКартинкой = "Печать"
		ИЛИ ИмяЭлементаСКартинкой = "ПодписьРуководителя"
		ИЛИ ИмяЭлементаСКартинкой = "ПодписьГлавногоБухгалтера" Тогда
		
		Фильтр = НСтр("ru = 'Формат PNG(*.png*)|*.png'");
		
	Иначе
	
		Фильтр = НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
			+ "|Все файлы(*.*)|*.*"
			+ "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
			+ "|Формат GIF(*.gif*)|*.gif"
			+ "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
			+ "|Формат PNG(*.png*)|*.png"
			+ "|Формат TIFF(*.tif)|*.tif"
			+ "|Формат icon(*.ico)|*.ico"
			+ "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
	
	КонецЕсли;
		
	//РаботаСФайламиКлиент.ДобавитьФайлы(Запись.ИсходныйКлючЗаписи, УникальныйИдентификатор, Фильтр);
	
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл";
		Диалог.ПолноеИмяФайла = ""; 
		Диалог.Фильтр = Фильтр; 
		Диалог.МножественныйВыбор = Ложь;
		//Если Диалог.Выбрать() Тогда
			//Элемент.значение = Диалог.ПолноеИмяФайла;
			//ВыбираемаяКартинка = Диалог.ПолноеИмяФайла;
			//Бинарник = новый ДвоичныеДанные(ВыбираемаяКартинка);
			//хз =ПоместитьВоВременноеХранилище(Бинарник,новый УникальныйИдентификатор);
			//УстановитьИзображение(хз,ИмяЭлементаСКартинкой);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма,ИмяЭлементаСКартинкой); 
			Диалог.Показать(ОписаниеОповещения);	
		//КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте 
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт 
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма, ДопПараметр); 
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); 
КонецПроцедуры	

&НаКлиенте 
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли;
	Если ДопПараметры = "Печать" Тогда
		АдресПечать = Адрес; 
	ИначеЕсли ДопПараметры = "ПодписьРуководителя" Тогда
		АдресПодписьРуководителя = Адрес;
	КонецЕсли;	
	Модифицированность = Истина; 
КонецПроцедуры

Процедура УстановитьИзображение(хз,ИмяЭлементаСКартинкой)
	
	Если хз = Неопределено Тогда
		ХранНовое = Новый ХранилищеЗначения(Неопределено);
	Иначе	
		файл = ПолучитьИзВременногоХранилища(хз);
		ИмяТемпФайла = ПолучитьИмяВременногоФайла();
		файл.Записать(ИмяТемпФайла);
		НовоеХД=Новый Картинка(ИмяТемпФайла); 
	    ХранНовое=Новый ХранилищеЗначения(НовоеХД); 
	КонецЕсли;
    ЭлементСправочника = РеквизитФормыВЗначение("Запись");
	Если ИмяЭлементаСКартинкой = "Печать" Тогда
    	ЭлементСправочника.ФайлПечать=ХранНовое; 
	Иначе
    	ЭлементСправочника.ФайлПодписьРуководителя=ХранНовое; 
	КонецЕсли;	
    ЭлементСправочника.Записать(); 
    ЗначениеВРеквизитФормы(ЭлементСправочника, "Запись");
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьПечать(Команда)
	//УстановитьИзображение(Неопределено,"Печать");
	ОчиститьКартинку("Печать");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКартинку(ИмяЭлементаСКартинкой)

	Модифицированность = Истина;
	ИмяФайла = "Файл" + ИмяЭлементаСКартинкой;
	ИмяАдресаКартинки = "Адрес" + ИмяЭлементаСКартинкой;
	//Запись[ИмяФайла] = Неопределено;
	ЭтотОбъект[ИмяАдресаКартинки] = "";
	//ОчиститьКартинкуНаСервере(ИмяФайла,ИмяАдресаКартинки);
	//УстановитьКартинкуНаФорме(Запись[ИмяАдресаКартинки], Запись[ИмяФайла]);
	//УправлениеФормой(ЭтаФорма);

КонецПроцедуры

Процедура ОчиститьКартинкуНаСервере(ИмяФайла,ИмяАдресаКартинки)
	//ФайлКартинки = ПолучитьИзВременногоХранилища(АдресПечать);
	МенеджерЗаписи = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Запись.ИсходныйКлючЗаписи);
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи[ИмяФайла] = Неопределено;
	//МенеджерЗаписи.ИзменяемыйРесурс = НовоеЗначение;
	//ТекущийОбъект.ФайлПечать = Новый ХранилищеЗначения(ФайлКартинки); 
	//УдалитьИзВременногоХранилища(АдресПечать); 
	//АдресПечать = ПолучитьНавигационнуюСсылку(Запись.ИсходныйКлючЗаписи,"ФайлПечать");
КонецПроцедуры	

&НаКлиенте
// Процедура отвечает за отображение/обновление соответствующей картинки
//
Процедура УстановитьКартинкуНаФорме(АктивныйАдрес, РеквизитОбъекта)
	
	Если ЗначениеЗаполнено(РеквизитОбъекта) Тогда
		АктивныйАдрес = ПолучитьКартинку(РеквизитОбъекта, УникальныйИдентификатор);
	Иначе
		АктивныйАдрес = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает навигационую ссылку файла
//
Функция ПолучитьКартинку(ФайлКартинки, УникальныйИдентификатор)
	
	ДанныеКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
	ПроверитьРазмерКартинки(ДанныеКартинки);
	Возврат ДанныеКартинки.СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверитьРазмерКартинки(ДанныеКартинки)
	
	УправлениеПечатьюБП.ДопустимыйРазмерКартинки(ДанныеКартинки.Размер, ДанныеКартинки.ИмяФайла, ДанныеКартинки.Владелец, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьПечатьНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьОчиститьКартинку("Печать", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьКартинку(ИмяКартинки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Запись["Файл" + ИмяКартинки].Пустая() Тогда
		ЗагрузитьКартинку(ИмяКартинки);
	Иначе
		ОчиститьКартинку(ИмяКартинки);
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	//Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	// Группа Логотип и подпись
	ИменаКартинок = Новый Структура;
	ИменаКартинок.Вставить("Печать",                    НСтр("ru='печать'"));
	ИменаКартинок.Вставить("ПодписьРуководителя",       НСтр("ru='подпись'"));
	Для Каждого КлючИЗначение Из ИменаКартинок Цикл
		ИмяФайла       = "Файл" + КлючИЗначение.Ключ;
		ЭлементФормы   = "ЗагрузитьОчистить" + КлючИЗначение.Ключ;
		ОбъектДействия = КлючИЗначение.Значение;
		//Если Запись[ИмяФайла].Пустая() Тогда
		//	Форма[ЭлементФормы] = СтрШаблон(НСтр("ru='Загрузить %1'"), ОбъектДействия); // Например, "Загрузить логотип"
		//Иначе
		//	Форма[ЭлементФормы] = СтрШаблон(НСтр("ru='Очистить %1'"),  ОбъектДействия); // Например, "Очистить логотип"
		//Конецесли;
	КонецЦикла;
	
	//Элементы.ДекорацияПредупреждениеФорматФаксимиле.Видимость = 
	//НЕ (ЗначениеЗаполнено(Объект.ФайлПечать) 
	//	ИЛИ ЗначениеЗаполнено(Объект.ФайлПодписьРуководителя));
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЭлементСправочника=ТекущийОбъект;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ЭлементСправочника.Организация);
	Отбор.Вставить("ОбъектыАренды", ЭлементСправочника.ОбъектыАренды);
	Отбор.Вставить("ГруппаУслуг", ЭлементСправочника.ГруппаУслуг);
	Отбор.Вставить("ЗаКогоПодписывает", ЭлементСправочника.ЗаКогоПодписывает);
	Отбор.Вставить("ВидДоговора", ЭлементСправочника.ВидДоговора);
	Отбор.Вставить("Период", ЭлементСправочника.Период);
	КлючЗаписиРег = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьКлючЗаписи(Отбор);
	АдресПечать = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать"); 
	АдресПодписьРуководителя = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПодписьРуководителя");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуПодписьРуководителя(Команда)
	ЗагрузитьКартинку("ПодписьРуководителя");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодписьРуководителя(Команда)
	//УстановитьИзображение(Неопределено,"ПодписьРуководителя");
	ОчиститьКартинку("ПодписьРуководителя");
КонецПроцедуры

&НаКлиенте
Процедура АдресПечатьНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗагрузитьКартинку("Печать");
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресПечать) Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(АдресПечать); 
		ТекущийОбъект.ФайлПечать = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(АдресПечать); 
		АдресПечать = ПолучитьНавигационнуюСсылку(Запись.ИсходныйКлючЗаписи,"ФайлПечать");
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресПодписьРуководителя) Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(АдресПодписьРуководителя); 
		ТекущийОбъект.ФайлПодписьРуководителя = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(АдресПодписьРуководителя); 
		АдресПодписьРуководителя = ПолучитьНавигационнуюСсылку(Запись.ИсходныйКлючЗаписи,"ФайлПодписьРуководителя");
	КонецЕсли;
	
	Если АдресПечать = "" Тогда
		ТекущийОбъект.ФайлПечать = Неопределено;
		//МенеджерЗаписи = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьМенеджерЗаписи();
		//ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Запись.ИсходныйКлючЗаписи);
		//МенеджерЗаписи.Прочитать();
		//МенеджерЗаписи.ФайлПечать = Неопределено;
		//МенеджерЗаписи.Записать();
		
		//ЭлементСправочника=ТекущийОбъект;
		//Отбор = Новый Структура;
		//Отбор.Вставить("Организация", ЭлементСправочника.Организация);
		//Отбор.Вставить("ОбъектыАренды", ЭлементСправочника.ОбъектыАренды);
		//Отбор.Вставить("ГруппаУслуг", ЭлементСправочника.ГруппаУслуг);
		//Отбор.Вставить("ЗаКогоПодписывает", ЭлементСправочника.ЗаКогоПодписывает);
		//Отбор.Вставить("ВидДоговора", ЭлементСправочника.ВидДоговора);
		//Отбор.Вставить("Период", ЭлементСправочника.Период);
		//КлючЗаписиРег = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьКлючЗаписи(Отбор);
		//АдресПечать = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать"); 
	КонецЕсли;	
	
	Если АдресПодписьРуководителя = "" Тогда
		ТекущийОбъект.ФайлПодписьРуководителя = Неопределено;
	КонецЕсли;	

КонецПроцедуры  

&НаКлиенте
Процедура АдресПодписьРуководителяНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗагрузитьКартинку("ПодписьРуководителя");
КонецПроцедуры
